perf/jmeter/S5-mixed.jmx
<?xml version="1.0" encoding="UTF-8"?>
<!--
  S5 混合场景 —— 文档目标：详情 5000 + 秒杀 3000 + 轮询 2000 / 5 min / 全部达标、无降级触发

  **单接口全达标不代表混合场景达标**，这是单独测它的理由：三类请求抢的是
  同一个 Tomcat 线程池、同一个 Lettuce 连接池、同一个 Redis 实例。
  单测时详情读能吃满 Redis，混进秒杀之后 Lua 就要排队 ——
  而 Lua 慢下来会让秒杀提交的 P99 涨，这个耦合只有混合测能看到。

  三个线程组按文档比例并行（默认按 5:3:2 缩放到 -Jscale 指定的总量）。
  秒杀那一组用 recycle=true：混合场景要跑满 5 分钟，用户表会被用完，
  所以这里接受「后续请求走已购买/售罄快速失败」——
  混合场景测的是**共存时的相互影响**，不是资格分配路径本身（那是 S2 的事）。

  「无降级触发」这一条要看 fss_degrade_level 指标：跑完用
  curl /actuator/prometheus | grep fss_degrade_level 确认仍是 0。
  自动降级在 perf profile 里是关掉的，所以这条断言在本机压测下退化为
  「积压与连接池等待未达阈值」，由驱动脚本采样 fss_mq_backlog 与 Hikari pending 验证。

  参数：-Jhost -Jport -Jactivity -Jsku -Jscale -Jduration -Jrampup -Jusers_csv -Jreq_csv
-->
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6.3">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="S5 混合场景" enabled="true">
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <!-- 必须 false：三个线程组要**同时**跑，串行化就成了三个独立场景 -->
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="UDV" enabled="true">
        <collectionProp name="Arguments.arguments">
          <elementProp name="HOST" elementType="Argument">
            <stringProp name="Argument.name">HOST</stringProp>
            <stringProp name="Argument.value">${__P(host,127.0.0.1)}</stringProp>
          </elementProp>
          <elementProp name="PORT" elementType="Argument">
            <stringProp name="Argument.name">PORT</stringProp>
            <stringProp name="Argument.value">${__P(port,8080)}</stringProp>
          </elementProp>
          <elementProp name="ACTIVITY" elementType="Argument">
            <stringProp name="Argument.name">ACTIVITY</stringProp>
            <stringProp name="Argument.value">${__P(activity,1)}</stringProp>
          </elementProp>
          <elementProp name="SKU" elementType="Argument">
            <stringProp name="Argument.name">SKU</stringProp>
            <stringProp name="Argument.value">${__P(sku,1)}</stringProp>
          </elementProp>
          <!-- 总并发，按 5:3:2 分配。文档的 10000 对应 -Jscale=10000 -->
          <elementProp name="SCALE" elementType="Argument">
            <stringProp name="Argument.name">SCALE</stringProp>
            <stringProp name="Argument.value">${__P(scale,1000)}</stringProp>
          </elementProp>
        </collectionProp>
      </elementProp>
    </TestPlan>
    <hashTree>

      <ConfigTestElement guiclass="HttpDefaultsGui" testclass="ConfigTestElement" testname="HTTP 默认值" enabled="true">
        <stringProp name="HTTPSampler.domain">${HOST}</stringProp>
        <stringProp name="HTTPSampler.port">${PORT}</stringProp>
        <stringProp name="HTTPSampler.connect_timeout">3000</stringProp>
        <stringProp name="HTTPSampler.response_timeout">15000</stringProp>
        <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
          <collectionProp name="Arguments.arguments"/>
        </elementProp>
      </ConfigTestElement>
      <hashTree/>

      <!-- ============ 组 1：活动详情读（50%）—— 匿名，不需要 token ============ -->
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="混合-详情读 50%" enabled="true">
        <stringProp name="ThreadGroup.num_threads">${__groovy((Integer.parseInt(vars.get('SCALE')) * 0.5) as int)}</stringProp>
        <stringProp name="ThreadGroup.ramp_time">${__P(rampup,15)}</stringProp>
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <boolProp name="ThreadGroup.scheduler">true</boolProp>
        <stringProp name="ThreadGroup.duration">${__P(duration,120)}</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController">
          <stringProp name="LoopController.loops">-1</stringProp>
          <boolProp name="LoopController.continue_forever">true</boolProp>
        </elementProp>
      </ThreadGroup>
      <hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="S5-详情" enabled="true">
          <stringProp name="HTTPSampler.path">/api/activity/${ACTIVITY}</stringProp>
          <stringProp name="HTTPSampler.method">GET</stringProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments"/>
          </elementProp>
        </HTTPSamplerProxy>
        <hashTree/>
      </hashTree>

      <!-- ============ 组 2：秒杀提交（30%） ============ -->
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="混合-秒杀提交 30%" enabled="true">
        <stringProp name="ThreadGroup.num_threads">${__groovy((Integer.parseInt(vars.get('SCALE')) * 0.3) as int)}</stringProp>
        <stringProp name="ThreadGroup.ramp_time">${__P(rampup,15)}</stringProp>
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <boolProp name="ThreadGroup.scheduler">true</boolProp>
        <stringProp name="ThreadGroup.duration">${__P(duration,120)}</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController">
          <stringProp name="LoopController.loops">-1</stringProp>
          <boolProp name="LoopController.continue_forever">true</boolProp>
        </elementProp>
      </ThreadGroup>
      <hashTree>
        <CSVDataSet guiclass="TestBeanGUI" testclass="CSVDataSet" testname="users.csv" enabled="true">
          <stringProp name="filename">${__P(users_csv,users.csv)}</stringProp>
          <stringProp name="fileEncoding">UTF-8</stringProp>
          <stringProp name="variableNames">UNAME,USERID,TOKEN</stringProp>
          <boolProp name="ignoreFirstLine">false</boolProp>
          <stringProp name="delimiter">,</stringProp>
          <boolProp name="quotedData">false</boolProp>
          <boolProp name="recycle">true</boolProp>
          <boolProp name="stopThread">false</boolProp>
          <stringProp name="shareMode">shareMode.all</stringProp>
        </CSVDataSet>
        <hashTree/>
        <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="头" enabled="true">
          <collectionProp name="HeaderManager.headers">
            <elementProp name="" elementType="Header">
              <stringProp name="Header.name">Content-Type</stringProp>
              <stringProp name="Header.value">application/json;charset=UTF-8</stringProp>
            </elementProp>
            <elementProp name="" elementType="Header">
              <stringProp name="Header.name">Authorization</stringProp>
              <stringProp name="Header.value">Bearer ${TOKEN}</stringProp>
            </elementProp>
          </collectionProp>
        </HeaderManager>
        <hashTree/>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="S5-秒杀" enabled="true">
          <stringProp name="HTTPSampler.path">/api/seckill/do</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">{"activityId":${ACTIVITY},"skuId":${SKU},"quantity":1}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
        </HTTPSamplerProxy>
        <hashTree/>
      </hashTree>

      <!-- ============ 组 3：结果轮询（20%） ============ -->
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="混合-结果轮询 20%" enabled="true">
        <stringProp name="ThreadGroup.num_threads">${__groovy((Integer.parseInt(vars.get('SCALE')) * 0.2) as int)}</stringProp>
        <stringProp name="ThreadGroup.ramp_time">${__P(rampup,15)}</stringProp>
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <boolProp name="ThreadGroup.scheduler">true</boolProp>
        <stringProp name="ThreadGroup.duration">${__P(duration,120)}</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController">
          <stringProp name="LoopController.loops">-1</stringProp>
          <boolProp name="LoopController.continue_forever">true</boolProp>
        </elementProp>
      </ThreadGroup>
      <hashTree>
        <CSVDataSet guiclass="TestBeanGUI" testclass="CSVDataSet" testname="requests.csv" enabled="true">
          <stringProp name="filename">${__P(req_csv,requests.csv)}</stringProp>
          <stringProp name="fileEncoding">UTF-8</stringProp>
          <stringProp name="variableNames">REQNO,TOKEN</stringProp>
          <boolProp name="ignoreFirstLine">false</boolProp>
          <stringProp name="delimiter">,</stringProp>
          <boolProp name="quotedData">false</boolProp>
          <boolProp name="recycle">true</boolProp>
          <boolProp name="stopThread">false</boolProp>
          <stringProp name="shareMode">shareMode.all</stringProp>
        </CSVDataSet>
        <hashTree/>
        <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="头" enabled="true">
          <collectionProp name="HeaderManager.headers">
            <elementProp name="" elementType="Header">
              <stringProp name="Header.name">Authorization</stringProp>
              <stringProp name="Header.value">Bearer ${TOKEN}</stringProp>
            </elementProp>
          </collectionProp>
        </HeaderManager>
        <hashTree/>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="S5-轮询" enabled="true">
          <stringProp name="HTTPSampler.path">/api/seckill/result</stringProp>
          <stringProp name="HTTPSampler.method">GET</stringProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="requestNo" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">true</boolProp>
                <stringProp name="Argument.name">requestNo</stringProp>
                <stringProp name="Argument.value">${REQNO}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
                <boolProp name="HTTPArgument.use_equals">true</boolProp>
              </elementProp>
              <elementProp name="activityId" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">true</boolProp>
                <stringProp name="Argument.name">activityId</stringProp>
                <stringProp name="Argument.value">${ACTIVITY}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
                <boolProp name="HTTPArgument.use_equals">true</boolProp>
              </elementProp>
              <elementProp name="skuId" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">true</boolProp>
                <stringProp name="Argument.name">skuId</stringProp>
                <stringProp name="Argument.value">${SKU}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
                <boolProp name="HTTPArgument.use_equals">true</boolProp>
              </elementProp>
            </collectionProp>
          </elementProp>
        </HTTPSamplerProxy>
        <hashTree/>
      </hashTree>

    </hashTree>
  </hashTree>
</jmeterTestPlan>